Kozurofu-San/kozurofu-drivers/platforms/STM32F4/UsbDriver.h
            if (epNums & (Ep1Mask << USB_OTG_DAINT_OEPINT_Pos))
            {
                uint32_t intr = epOut(Ep1)->DOEPINT;
                printf("\nO1(%04X)", (unsigned int)intr);
                if (intr & USB_OTG_DOEPINT_XFRC)
                {
                    transferRxCallback();
                    epOut(Ep1)->DOEPCTL |= USB_OTG_DOEPCTL_CNAK | USB_OTG_DOEPCTL_EPENA;  // CNAK and EPENA must be set again after every interrupt to let this EP recieve upcoming data
                }
                epOut(Ep1)->DOEPINT = intr;
            }
            return;
        }

        // RX FIFO not empty
        if (_usb->GINTSTS & USB_OTG_GINTSTS_RXFLVL)
        {
            uint32_t status = _usb->GRXSTSP;   // Read out packet status

            if (((status & USB_OTG_GRXSTSP_PKTSTS) >> USB_OTG_GRXSTSP_PKTSTS_Pos) ==  StsDataUpdt)      // 0010: OUT data packet received
            {
                printf("\n%d d", cnt++); 
                if (status & USB_OTG_GRXSTSP_BCNT)     // Byte count > 0
                {
                    uint16_t length = ((status & USB_OTG_GRXSTSP_BCNT) >> USB_OTG_GRXSTSP_BCNT_Pos);
                    uint8_t EpNum =	((status & USB_OTG_GRXSTSP_EPNUM) >> USB_OTG_GRXSTSP_EPNUM_Pos);
                    readFifo(EpNum, length);   //  Read data from DFIFO
                }
            }
            else if (((status & USB_OTG_GRXSTSP_PKTSTS) >> USB_OTG_GRXSTSP_PKTSTS_Pos) ==  StsSetupUpdt)  // 0110: SETUP data packet received
            {
                // Read FFIO
                setup_pkt_data.raw_data[0] = *fifo(0);
                setup_pkt_data.raw_data[1] = *fifo(0);
            }
            printf("\n"); 
            return;
        }
    }
    
    uint32_t write(uint8_t *txBuff, uint16_t len)   // Write to host
    {
        if (!(device_state & DEVICE_STATE_TX_PR) &
            !(epIn(Ep1)->DIEPTSIZ & USB_OTG_DIEPTSIZ_XFRSIZ) &
            ((epIn(Ep1)->DIEPTSIZ & USB_OTG_HCTSIZ_PKTCNT) == 0) &
            !(epIn(Ep1)->DIEPCTL & USB_OTG_DIEPCTL_EPENA)  &
            ((epIn(Ep1)->DIEPINT & USB_OTG_DIEPINT_TXFE) != 0))
        {
            setTxBuffer(Ep1, txBuff, len);
            return EpOk;
        }
        else return EpFailed;
    }
    
    uint32_t read(uint16_t length)  // CDC loopback echo
    {
        uint8_t *data = EndPoint[Ep1].rxBufferPtr;
        for (uint32_t i = 0; i < length; i++)
        {
            data[i] = data[i] + 1;
        }
        
        write(data, length);
        return length;
    }

    inline bool isInit() const { return _isInit; }
    inline uint32_t getSpeed() const { return _speed; }

    USB_OTG_GlobalTypeDef* getUsb() { return _usb; }
    
    private:

    USB_OTG_GlobalTypeDef   *_usb;
    USB_OTG_DeviceTypeDef   *_dev = reinterpret_cast<USB_OTG_DeviceTypeDef*>(USB_OTG_FS_PERIPH_BASE + USB_OTG_DEVICE_BASE);
    USB_OTG_HostTypeDef     *_host = reinterpret_cast<USB_OTG_HostTypeDef*>(USB_OTG_FS_PERIPH_BASE + USB_OTG_HOST_BASE);
    __IO uint32_t           *_pwr = reinterpret_cast<__IO uint32_t*>(USB_OTG_FS_PERIPH_BASE + USB_OTG_PCGCCTL_BASE);

    ITimer &_timer;
    uint32_t _speed = 0;
    bool _isInit = false;
    
    static constexpr uint32_t Ep0 = 0;
    static constexpr uint32_t Ep1 = 1;
    static constexpr uint32_t Ep2 = 2;
    static constexpr uint32_t Ep3 = 3;
    
    static constexpr uint32_t Ep0Mask = 1 << 0;
    static constexpr uint32_t Ep1Mask = 1 << 1;
    static constexpr uint32_t Ep2Mask = 1 << 2;
    static constexpr uint32_t Ep3Mask = 1 << 3;

    static constexpr uint8_t CdcMaxPacketSize   = 64;
    static constexpr uint8_t CdcCmdPacketSize   = 8;
    static constexpr uint8_t Ep0Size            = 64;
    static constexpr uint8_t EpCount            = 3;

    static constexpr uint16_t Vid = 0x0483;
    static constexpr uint16_t Pid = 0x5740;

    static constexpr uint16_t LangIdString = 1033;

    static constexpr uint8_t DeviceDescriptorLength         = 18;
    static constexpr uint8_t ConfigurationDescriptorLength  = 67;
    static constexpr uint8_t LangDescriptorLength           = 4;
    static constexpr uint8_t MfcDescriptorLength            = 38;
    static constexpr uint8_t ProductDescriptorLength        = 44;
    static constexpr uint8_t SerialDescriptorLength         = 26;
    static constexpr uint8_t DeviceQualifierLength          = 10;
    static constexpr uint8_t InterfaceStringLength          = 28;
    static constexpr uint8_t ConfigStringLength             = 22;
    static constexpr uint8_t CdcLineCodingLength            = 7;

    static constexpr uint16_t FlushFifoTimeout  = 2000;
    static constexpr uint16_t DtxfStsTimeout    = 1024;
    static constexpr uint16_t RxFifoSize        = 36;
    static constexpr uint16_t TxEp0FifoSize     = 16;
    static constexpr uint16_t TxEp1FifoSize     = 320-(RxFifoSize+TxEp0FifoSize);
    static constexpr uint16_t TxEp2FifoSize     = 0;
    static constexpr uint16_t TxEp3FifoSize     = 0;
    static constexpr uint16_t Ep1DtfXstsSize    = TxEp1FifoSize;
    static constexpr uint16_t Ep1MinDtfXstsLvl  = 16;
    static constexpr uint16_t MaxCdcEp0TxSiz    = 64;
    static constexpr uint16_t MaxCdcEp1TxSiz    = 256;
    static constexpr uint8_t DoeptTransferSize  = 0x40;
    static constexpr uint8_t DoeptTransferPct   = 0x01;

    static constexpr uint8_t EpReady    = 0;
    static constexpr uint8_t EpBusy     = 1;
    static constexpr uint8_t EpZlp      = 2;

    static constexpr uint8_t EpOk       = 1;
    static constexpr uint8_t EpFailed   = 0;

    static constexpr uint16_t ReqTypeHostToDeviceGetDeviceDecriptor = 0x0680;
    static constexpr uint16_t ReqTypeDeviceToHostSetAddress         = 0x0500;
    static constexpr uint16_t ReqTypeDeviceToHostSetConfiguration   = 0x0900;
    static constexpr uint16_t DescriptorTypeDevice                  = 0x0100;
    static constexpr uint16_t DescriptorTypeConfiguration           = 0x0200;
    static constexpr uint16_t DescriptorTypeLangString              = 0x0300;
    static constexpr uint16_t DescriptorTypeMfcString               = 0x0301;
    static constexpr uint16_t DescriptorTypeProdString              = 0x0302;
    static constexpr uint16_t DescriptorTypeSerialString            = 0x0303;
    static constexpr uint16_t DescriptorTypeConfigurationString     = 0x0304;
    static constexpr uint16_t DescriptorTypeInterfaceString         = 0x0305;
    static constexpr uint16_t DescriptorTypeDeviceQualifier         = 0x0600;
    static constexpr uint16_t CdcGetLineCoding                      = 0x21A1;
    static constexpr uint16_t CdcSetLineCoding                      = 0x2021;
    static constexpr uint16_t CdcSetControlLineState                = 0x2221;
    static constexpr uint16_t ClearFeatureEndp                      = 0x0102;

    static constexpr uint8_t StsDataUpdt    = 2;
    static constexpr uint8_t StsSetupUpdt   = 6;

    static constexpr uint16_t RxBufferEp0Size = 8;
    static constexpr uint16_t RxBufferEp1Size = 128;

