Kozurofu-San/kozurofu-drivers/platforms/STM32F4/UsbDriver.h
        EndPoint[EPnum].statusTx = EpBusy;      //Set Busy flag

        epIn(EPnum)->DIEPTSIZ = pct_cnt << USB_OTG_DIEPTSIZ_PKTCNT_Pos
            | len << USB_OTG_DIEPTSIZ_XFRSIZ_Pos;
        epIn(EPnum)->DIEPCTL |= USB_OTG_DIEPCTL_CNAK | USB_OTG_DIEPCTL_EPENA;
        
        while (writeFifo(EPnum, EndPoint[EPnum].txBufferPtr, len) == EpFailed)
        {
            if ((EPnum == Ep1) & (isEpStuck(Ep1) == EpFailed))       // Recovery Routine EP IN
            {
                epIn(EPnum)->DIEPCTL |= USB_OTG_DIEPCTL_EPDIS | USB_OTG_DIEPCTL_SNAK;
                epIn(EPnum)->DIEPTSIZ = 0;
            }
            epIn(EPnum)->DIEPTSIZ = pct_cnt << USB_OTG_DIEPTSIZ_PKTCNT_Pos
                | len << USB_OTG_DIEPTSIZ_XFRSIZ_Pos;
            epIn(EPnum)->DIEPCTL |= USB_OTG_DIEPCTL_CNAK | USB_OTG_DIEPCTL_EPENA;
            
            if ((EPnum == Ep1) & (epIn(EPnum)->DTXFSTS >= Ep1MinDtfXstsLvl))  // Check Fifo Free Space
            {
                // flushTxFifo(Ep1, FlushFifoTimeout);
                
                uint32_t count = 0;
                _usb->GRSTCTL = USB_OTG_GRSTCTL_TXFFLSH | (EPnum << USB_OTG_GRSTCTL_TXFNUM_Pos);
                do
                {
                    if (++count > FlushFifoTimeout)
                    {
                        break;
                    }
                }
                while (_usb->GRSTCTL & USB_OTG_GRSTCTL_TXFFLSH);
            
               return EpOk;

            }
        }

        if (EndPoint[EPnum].txCounter >= CdcMaxPacketSize)
        {
            if (!EndPoint[EPnum].txCounter && !residue)  // Was this packet of MaxSize the last one in the queue ? Is ZLP required?
            {
                EndPoint[EPnum].statusTx = EpZlp;        // Change EP TX status to ZLP, thereafter ZLP will be sent in sequential function call
                while (isEpStuck(EPnum) != EpOk);
                sendZlp(EPnum);
                return EpOk;
            }
        }
        else
        {
            device_state &= ~DEVICE_STATE_TX_PR;		
        }

        epOut(EPnum)->DOEPCTL |= USB_OTG_DOEPCTL_CNAK | USB_OTG_DOEPCTL_EPENA;  // Finish transmission
        EndPoint[EPnum].statusTx = EpReady;
        device_state &= ~DEVICE_STATE_TX_PR;

        return EpOk;
    }
    
    
    uint32_t setTxBuffer(uint8_t EPnum, uint8_t *txBuff, uint16_t len)
    {
        if (EndPoint[EPnum].txCounter || (EndPoint[EPnum].statusTx == EpZlp) || (device_state & DEVICE_STATE_TX_PR))
        {
            return EpFailed;    // Previous transaction is not finished
        }
    
        uint32_t max_transfer_sz = CdcMaxPacketSize - 1;
        max_transfer_sz += (EPnum == 0) ? MaxCdcEp0TxSiz : MaxCdcEp1TxSiz;
        if (len > max_transfer_sz) return EpFailed;
        
        if (len)
        {
            EndPoint[EPnum].txBufferPtr = txBuff;
            EndPoint[EPnum].txCounter = len;
            device_state |= DEVICE_STATE_TX_PR;
            transferTxCallback(EPnum);  // Send data
            
            return EpOk;
        }
        
        else    // ZLP
        {
            epIn(EPnum)->DIEPTSIZ = 0;
            epIn(EPnum)->DIEPTSIZ = 1 << USB_OTG_DIEPTSIZ_PKTCNT_Pos    // One Packet
                | 0 << USB_OTG_DIEPTSIZ_XFRSIZ_Pos;	                    //  Size 0
            epIn(EPnum)->DIEPCTL |= USB_OTG_DIEPCTL_CNAK | USB_OTG_DIEPCTL_EPENA;
        
            epOut(EPnum)->DOEPCTL |= USB_OTG_DOEPCTL_CNAK | USB_OTG_DOEPCTL_EPENA;
            return EpOk;
        }
    }
    
    void transferRXCallbackEp0()
    {
        uint16_t len = EndPoint[Ep0].rxCounter;	
        if(!len) return;
        if(EndPoint[Ep0].statusRx == EpBusy) return;
    }
    
    void transferRxCallback()
    {
        if (EndPoint[Ep1].statusRx == EpBusy) return;
        uint16_t len = EndPoint[Ep1].rxCounter;
        
        EndPoint[Ep1].rxBufferPtr -= EndPoint[Ep1].rxCounter;      // Reset RX counter and buffer pointer
        EndPoint[Ep1].rxCounter = 0;	
        
        read(len);
    
        epOut(Ep1)->DOEPTSIZ = DoeptTransferPct << USB_OTG_DOEPTSIZ_PKTCNT_Pos
            | DoeptTransferSize << USB_OTG_DOEPTSIZ_XFRSIZ_Pos;
        epOut(Ep1)->DOEPCTL |= USB_OTG_DOEPCTL_CNAK | USB_OTG_DOEPCTL_EPENA;
    }
    
    void enumerateReset()
    {
        device_state = DEVICE_STATE_RESET;  
        _usb->GINTSTS &= ~0xFFFFFFFF;
        
        _dev->DAINTMSK = 
            Ep0Mask << USB_OTG_DAINTMSK_IEPM_Pos |
            Ep1Mask << USB_OTG_DAINTMSK_IEPM_Pos |
            Ep0Mask << USB_OTG_DAINTMSK_OEPM_Pos |
            Ep1Mask << USB_OTG_DAINTMSK_OEPM_Pos ;

        _dev->DOEPMSK = USB_OTG_DOEPMSK_STUPM | USB_OTG_DOEPMSK_XFRCM;  // Unmask SETUP Phase done Mask, Transfer Completed interrupt for OUT
        _dev->DIEPMSK = USB_OTG_DIEPMSK_XFRCM;                          // TransfeR Completed interrupt for IN
        _dev->DCFG &= ~USB_OTG_DCFG_DAD_Msk;                            // Before Enumeration set address 0
    
        epIn(Ep1)->DIEPCTL =
            USB_OTG_DIEPCTL_SNAK    |
            USB_OTG_DIEPCTL_TXFNUM_0|   // TX Number 1
            USB_OTG_DIEPCTL_EPTYP_1 |   // Eptype 10 means Bulk
            USB_OTG_DIEPCTL_USBAEP  |   // Set Endpoint active
            CdcMaxPacketSize;           // Max Packet size (bytes)
        
        epOut(Ep1)->DOEPCTL =
            USB_OTG_DOEPCTL_EPENA   |   // Enable Endpoint
            USB_OTG_DOEPCTL_CNAK    |   // Clear NAK
            USB_OTG_DOEPCTL_EPTYP_1 |   // Eptype 10 means Bulk
            USB_OTG_DOEPCTL_USBAEP  |   // Set Endpoint active
            CdcMaxPacketSize;           // CHK MPSIZ The application must program this field with the maximum packet size for the current logical endpoint. This value is in bytes
    	
        epOut(Ep1)->DOEPTSIZ = DoeptTransferPct << USB_OTG_DOEPTSIZ_PKTCNT_Pos   // RM quote: Indicates the total number of USB packets that constitute the Transfer Size amount of data for this endpoint. This field is decremented every time a packet (maximum size or short packet) is written to the RxFIFO
            | DoeptTransferSize << USB_OTG_DOEPTSIZ_XFRSIZ_Pos;                // Transfer size. If you set transfer size = max. packet, the core will interrupt the application at the end of each packet
    
