Kozurofu-San/kozurofu-drivers/platforms/STM32F4/UsbDriver.h
        epIn(Ep2)->DIEPCTL =
            USB_OTG_DIEPCTL_SNAK            |
            2 << USB_OTG_DIEPCTL_TXFNUM_Pos |
            USB_OTG_DIEPCTL_EPTYP           |     // Eptype 11 means Interrupt EP 
            USB_OTG_DIEPCTL_USBAEP          |
            8 << USB_OTG_DIEPCTL_MPSIZ_Pos  ;                                                       
    }
    
    void enumerate_Setup()
    {
        uint16_t len = setup_pkt_data.setup_pkt.wLength;
        uint8_t *ptr;
        // printf(" s%04Xv%04X[%d]", setup_pkt_data.setup_pkt.wRequest, setup_pkt_data.setup_pkt.wValue, len);
        switch(setup_pkt_data.setup_pkt.wRequest)
        {
            case ReqTypeHostToDeviceGetDeviceDecriptor:
                switch(setup_pkt_data.setup_pkt.wValue)
                {
                    case DescriptorTypeDevice:                  // Request 0x0680  Value 0x0100 
                        if(DeviceDescriptorLength < len) len = DeviceDescriptorLength;
                        ptr = const_cast<uint8_t*>(deviceDescriptor);
                        break;
                    case DescriptorTypeConfiguration:           // Request 0x0680  Value 0x0200
                        if(ConfigurationDescriptorLength < len) len = ConfigurationDescriptorLength;
                        ptr = const_cast<uint8_t*>(configurationDescriptor);
                        break;    
                    case DescriptorTypeDeviceQualifier:         // Request 0x0680  Value 0x0600
                        if(DeviceQualifierLength < len) len = DeviceQualifierLength; 
                        ptr = const_cast<uint8_t*>(deviceQualifierDescriptor);
                        break;          
                    case DescriptorTypeLangString:              // Request 0x0680  Value 0x0300
                        if(LangDescriptorLength < len) len = LangDescriptorLength;   
                        ptr = const_cast<uint8_t*>(languageStringDescriptor);
                        break; 
                    case DescriptorTypeMfcString:               // Request 0x0680  Value 0x0301
                        if(MfcDescriptorLength < len) len = MfcDescriptorLength;
                        ptr = const_cast<uint8_t*>(manufactorStringDescriptor);
                        break;
                    case DescriptorTypeProdString:              // Request 0x0680  Value 0x0302
                        if(ProductDescriptorLength < len) len = ProductDescriptorLength;
                        ptr = const_cast<uint8_t*>(productStringDescriptor);
                        break;                     
                    case DescriptorTypeSerialString:            // Request 0x0680  Value 0x0303
                        if(SerialDescriptorLength < len) len = SerialDescriptorLength;
                        ptr = const_cast<uint8_t*>(serialNumberStringDescriptor);
                        break;
                    case DescriptorTypeConfigurationString:     // Request 0x0680  Value 0x0304
                        if(ConfigStringLength < len) len = ConfigStringLength;
                        ptr = const_cast<uint8_t*>(configurationStringDescriptor);
                        break;
                    case DescriptorTypeInterfaceString:         // Request 0x0680  Value 0x0305
                        if(InterfaceStringLength < len) len = InterfaceStringLength;
                        ptr = const_cast<uint8_t*>(stringInterface);
                        break;
                    default:
                        return;
                }
                break;
                
            case ReqTypeDeviceToHostSetAddress:                 // Request 0x0500
                _dev->DCFG |= setup_pkt_data.setup_pkt.wValue << 4;
                device_state |= DEVICE_STATE_ADDRESSED;
                break;
            case ReqTypeDeviceToHostSetConfiguration:           // Request 0x0900
                len = 0;    // ZLP
                // TODO: set configuration
                break;     
            
            case CdcGetLineCoding:                              // Request 0x21A1
                if(CdcLineCodingLength < len) len = CdcLineCodingLength;
                // ptr = const_cast<uint8_t*>(lineCoding);
                device_state |= DEVICE_STATE_LINECODED;
                break;
            
            case CdcSetLineCoding:                              // Request 0x2021
                len = 0;		
                break;       
            case CdcSetControlLineState:                        // Request 0x2221
                len = 0;	
                break;	
            case ClearFeatureEndp:                              // Request 0x0201
                return;
            default:
                break;
        } 
        
        setTxBuffer(Ep0, ptr, len);
    }
    
    uint32_t isEpStuck(uint8_t EPnum)
    {
        if ((epIn(EPnum)->DIEPCTL & USB_OTG_DIEPCTL_EPENA)  &       // EPENA stuck
            !(epIn(EPnum)->DIEPTSIZ & USB_OTG_DIEPTSIZ_XFRSIZ) &    // No data pending
            (epIn(EPnum)->DIEPTSIZ & USB_OTG_HCTSIZ_PKTCNT))        // Packet count pending
        {
            return EpFailed;
        }
        else return EpOk;
    }
    
    uint8_t rxBufferEp0[RxBufferEp0Size];   // Recieved data is stored here after application reads DFIFO. RX FIFO is shared
    uint8_t rxBufferEp1[RxBufferEp1Size];   // Recieved data is stored here after application reads DFIFO. RX FIFO is shared
    
    USB_setup_req_data setup_pkt_data;      // Setup Packet var

    /* Device string descriptor */
    static constexpr uint8_t deviceDescriptor[DeviceDescriptorLength] = {
        DeviceDescriptorLength,     
        0x01,                       /* Descriptor type - device */
        0x00, 0x02,                 /*  0x0110 = usb 1.1 ; 0x0200 = usb 2.0 */
        0x02,                       /* CDC */
        0x02,                       /*  Abstract Control Model subclass */
        0x00,                       /* protocol */
        Ep0Size,                    /* EP0 size */
        loByte(Vid), hiByte(Vid),   /* VID */
        loByte(Pid), hiByte(Pid),   /* PID */
        0x00,                       /* ver. (BCD) */
        0x02,                       /* ver. (BCD) */	
        0x01,                       /* Manufactor string index */
        0x02,                       /* Product string index */
        0x03,                       /* Serial number string index */
        1                           /* configuration count */
    };

